---
kind: method
id: M:Autodesk.Revit.DB.ModelCurveArrArrayIterator.#ctor
source: html/85888484-5f47-66a6-665d-6b5698044250.htm
---
# Autodesk.Revit.DB.ModelCurveArrArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public ModelCurveArrArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.